---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletError
source: html/771aab69-5be2-b6fc-52fe-337e23fb5d34.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletError Property

Fillet cannot be created between rail segment since the radius is lower than the profile size.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailProfileLowerThanFilletError { get; }
```